import { Content } from "next/font/google";

export const TITLE = "סדנת פיתוח תוכנה";
export const SUBTITLE = "היכרות עם עקרונות התכנות תוך כדי לימוד אנגלית";

export interface Paragraph {
    title: string;
    content: string;
}

export const PARAGRAPHS: Paragraph[] = [
    {
        title: "✨ למה דווקא הסדנה שלנו?",
        content: `בואו להעניק לילדיכם חוויה שהיא למידה, סיפוק והנאה.
הילד שלך ילמד מה זה קוד, מהי שפת תוכנה, יפתח יכולות שימוש במחשב וירכוש הבנה בעולמות המיחשוב והטכנולוגיה.
בסדנה נלמד מה זה משתנים, טיפוסים, ואפילו תנאים ולולאות.
הסדנה מיועדת לילדים חבדניקים, ולכן אין תנאי קבלה - לא צריך רקע באנגלית; לא צריך שום רקע בתכנות; לא צריך ידע בשימוש במחשב; אנחנו נלמד הכל מאפס.
הסדנה תהיה על בסיס מפגשים שבועיים. היא תחולק לקבוצות לפי גילאים ושיקולים נוספים, כדי שכל ילד יותאם לרמת הלמידה שהכי מתאימה לו. 
כל קבוצה תכיל מספר מצומצם מאוד של ילדים, וכך חוויית הלמידה תהיה אישית ופרטנית
`
    },
    {
        title: "💻 למה כדאי ללמד את הילד שלך פיתוח תוכנה?",
        content: `ככל שהעולם שלנו מתקדם לעבר העתיד, אנחנו מבינים יותר ויותר כמה כתיבת קוד והתעסקות עם "מאחורי הקלעים" של המחשב הופכת להיות חלק חשוב ועיקרי מהחיים שלנו.
ברגע שהתחלתי ללמוד כתיבת קוד ופיתוח תוכנה, הבנתי שלא רחוק היום שבו ילדים ילמדו לתכנת בבית הספר.
מהר מכפי שנראה לכם הילד שלכם יכתוב תכניות שלמות.
רק מי שחווה את ההרצה של התכנית הראשונה שלו על המחשב מכיר את הריגוש שבלראות את מעשה ידיו מתרחש לנגד עיניו.`
    },
    {
        title: "🚀 לא בשמים היא",
        content: `תכנות זה לא דבר רחוק כמו שזה נשמע.
כבר אחרי מבוא קצר לאיך הדברים עובדים, אפשר להתחיל לכתוב קוד ולראות תוצאות!

שפות התכנות של ימינו קרובות באופן מפתיע לשפת אדם. הבולטת שבהן היא "שפת פייתון".
פייתון היא שפה די חדשה, ומהשפות הכי פופולאריות היום - בגלל הפשטות שבשימוש בה.

ההבדל בין שפות העילית השונות מתבטא בעיקר בתחביר, ולכן, למי שרק ניגש להיכרות עם עקרונות התכנות הכי מומלץ להתחיל לכתוב בפייתון.`
    },
   
    {
        title: "📍 למי הסדנה מיועדת?",
        content: `כרגע אנחנו פעילים בשכונת חבד בלוד. הסדנה מיועדת לילדים שגרים באיזור או עם גישה נוחה לאיזור.
כל ילד חבדניק מגילאי 10 עד 13 יכולים להרשם לסדנה, מבלי קשר לידע שלו באנגלית או בכל תחום אחר.

מהרו להרשם - מספר המקומות מוגבל!`
    }
];
